maoravni/Dev/FECDEV/FEC/Common/Libraries/BSP/psocSpiWithDma.c
/*
 * spiWithDma.c
 *
 *  Created on: 5 бреб 2013
 *      Author: maora
 */

#include <psocSpiWithDma.h>
#ifdef STM32F4XX
#include <stm32f4xx.h>
#else
#include <stm32f2xx.h>
#endif

#include <FreeRTOSConfig.h>
#include <FreeRTOS.h>
#include <semphr.h>
#include <task.h>
#include <stdio.h>
#include <ll_typedef.h>
#include <assert.h>
#include <arm_itm.h>
#include <PscSubsystem.h>
#include <cybootloaderutils/cybtldr_utils.h>
#include <cybootloaderutils/cybtldr_api.h>

/* This structure contains function pointers to the four communication layer functions
 contained in the communication_api.c / .h */
CyBtldr_CommunicationsData CyBtldr_Callbacks;

#define CS1_HIGH()    GPIOD->BSRRL = GPIO_Pin_2
#define CS2_HIGH()    GPIOC->BSRRL = GPIO_Pin_6
#define CS3_HIGH()    GPIOC->BSRRL = GPIO_Pin_7
#define CS4_HIGH()    GPIOC->BSRRL = GPIO_Pin_8

#define CS5_FEC2_HIGH()    GPIOF->BSRRL = GPIO_Pin_0
#define CS5_FEC3_HIGH()    GPIOE->BSRRL = GPIO_Pin_2

#define CS6_HIGH()    GPIOD->BSRRL = GPIO_Pin_15
#define CS7_HIGH()    GPIOD->BSRRL = GPIO_Pin_6
#define CS8_HIGH()    GPIOC->BSRRL = GPIO_Pin_9

#define CS9_HIGH()    GPIOD->BSRRL = GPIO_Pin_7
#define CS10_HIGH()    GPIOB->BSRRL = GPIO_Pin_6

//#define CS1_LOW()    GPIOD->BSRRH = GPIO_Pin_2
//#define CS2_LOW()    GPIOC->BSRRH = GPIO_Pin_6
//#define CS3_LOW()    GPIOC->BSRRH = GPIO_Pin_7
//#define CS4_LOW()    GPIOC->BSRRH = GPIO_Pin_8
//#define CS5_LOW()    GPIOC->BSRRH = GPIO_Pin_9
//#define CS6_LOW()    GPIOD->BSRRH = GPIO_Pin_6
//#define CS7_LOW()    GPIOD->BSRRH = GPIO_Pin_15
//#define CS8_LOW()    GPIOF->BSRRH = GPIO_Pin_0

xSemaphoreHandle psocSpiResponseCompleteSemaphore = NULL;
T_PsocSpiReceiveFrame psocSpiResponseBuffer;
T_PsocSpiReceiveFrame psocSpiTransmitBuffer;
//int g_txInterruptState;
//int g_rxInterruptState;

#define M_DELAY_BETWEEN_PSOC_TRANSFERS 3

void setupSpi()
{
    GPIO_InitTypeDef GPIO_InitStructure;
    SPI_InitTypeDef SPI_InitStructure;

    /*!< Enable the SPI clock */
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_SPI3, ENABLE);

    /*!< Enable GPIO clocks */
    RCC_AHB1PeriphClockCmd(
    RCC_AHB1Periph_GPIOC | RCC_AHB1Periph_GPIOD | RCC_AHB1Periph_GPIOE | RCC_AHB1Periph_GPIOF | RCC_AHB1Periph_GPIOB,
            ENABLE);

    /*!< SPI pins configuration *************************************************/
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
    GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_DOWN;

    /*!< SPI SCK MISO MOSI pin configuration */
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10 | GPIO_Pin_11 | GPIO_Pin_12;
    GPIO_Init(GPIOC, &GPIO_InitStructure);

    /*!< Connect SPI3 pins to AF6 */
    GPIO_PinAFConfig(GPIOC, GPIO_PinSource10, GPIO_AF_SPI3);
    GPIO_PinAFConfig(GPIOC, GPIO_PinSource11, GPIO_AF_SPI3);
    GPIO_PinAFConfig(GPIOC, GPIO_PinSource12, GPIO_AF_SPI3);

#ifdef STM32F4XX
    /*!< Configure CS Pins for the PSoC */
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
    GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
    GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;

    if (Psc_BoardType == E_BoardType_Fec2)
    {
        GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2 | GPIO_Pin_6 | GPIO_Pin_15;
        GPIO_Init(GPIOD, &GPIO_InitStructure);

        GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6 | GPIO_Pin_7 | GPIO_Pin_8 | GPIO_Pin_9;
        GPIO_Init(GPIOC, &GPIO_InitStructure);

        GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0;
        GPIO_Init(GPIOF, &GPIO_InitStructure);
        CS1_HIGH();
        CS2_HIGH();
        CS3_HIGH();
        CS4_HIGH();
        CS5_FEC2_HIGH();
        CS6_HIGH();
        CS7_HIGH();
        CS8_HIGH();
    }
    if (Psc_BoardType == E_BoardType_Fec3)
    {
        GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2 | GPIO_Pin_6 | GPIO_Pin_15 | GPIO_Pin_7;
        GPIO_Init(GPIOD, &GPIO_InitStructure);

        GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6 | GPIO_Pin_7 | GPIO_Pin_8 | GPIO_Pin_9;
        GPIO_Init(GPIOC, &GPIO_InitStructure);

        GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2;
        GPIO_Init(GPIOE, &GPIO_InitStructure);

        GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6;
        GPIO_Init(GPIOB, &GPIO_InitStructure);

        // This is needed for resetting the PSoCs:
        GPIO_InitStructure.GPIO_Pin = GPIO_Pin_13;
        GPIO_Init(GPIOF, &GPIO_InitStructure);

        CS1_HIGH();
        CS2_HIGH();
        CS3_HIGH();
        CS4_HIGH();
        CS5_FEC3_HIGH();
        CS6_HIGH();
        CS7_HIGH();
        CS8_HIGH();
        CS9_HIGH();
        CS10_HIGH();
    }

#endif

    SPI_I2S_DeInit(PSOC_SPI_PORT);
    /*!< SPI configuration */
    SPI_StructInit(&SPI_InitStructure);
    SPI_InitStructure.SPI_Direction = SPI_Direction_2Lines_FullDuplex;
    SPI_InitStructure.SPI_Mode = SPI_Mode_Master;
    SPI_InitStructure.SPI_DataSize = SPI_DataSize_8b;
    SPI_InitStructure.SPI_CPOL = SPI_CPOL_Low;
    SPI_InitStructure.SPI_CPHA = SPI_CPHA_1Edge;   //SPI_CPHA_1Edge
    SPI_InitStructure.SPI_NSS = SPI_NSS_Soft;
    SPI_InitStructure.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_16;
    SPI_InitStructure.SPI_FirstBit = SPI_FirstBit_MSB;
    SPI_InitStructure.SPI_CRCPolynomial = 7;
    SPI_Init(PSOC_SPI_PORT, &SPI_InitStructure);

    /*!< Enable the SPI  */
    SPI_Cmd(PSOC_SPI_PORT, ENABLE);

}

void setupTxDma()
{
    DMA_InitTypeDef DMA_InitStructure;
    NVIC_InitTypeDef NVIC_InitStructure;

    // Set up the DMA
    DMA_DeInit(PSOC_SPI_PORT_TX_DMA_STREAM);
    /*
     * Check if the DMA Stream is disabled before enabling it.
     * Note that this step is useful when the same Stream is used multiple times:
     * enabled, then disabled then re-enabled... In this case, the DMA Stream disable
     * will be effective only at the end of the ongoing data transfer and it will
     * not be possible to re-configure it before making sure that the Enable bit
     * has been cleared by hardware. If the Stream is used only once, this step might
     * be bypassed.
     */
    while (DMA_GetCmdStatus(PSOC_SPI_PORT_TX_DMA_STREAM) != DISABLE)
        ;
    // Configure DMA controller to manage TX DMA requests
    // first make sure we are using the default values
    DMA_StructInit(&DMA_InitStructure);
    // these are the only parameters that change from the defaults
    DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t) & (PSOC_SPI_PORT->DR);
    DMA_InitStructure.DMA_Channel = PSOC_SPI_PORT_TX_DMA_CHANNEL;
    DMA_InitStructure.DMA_DIR = DMA_DIR_MemoryToPeripheral;
    DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
    DMA_InitStructure.DMA_Priority = DMA_Priority_High;
    /*
     * It is not possible to call DMA_Init without values for the source
     * address and non-zero size even though a transfer is not done here.
     * These are checked only when the assert macro are active though.
     * */
    DMA_InitStructure.DMA_Memory0BaseAddr = 0;
    DMA_InitStructure.DMA_BufferSize = 1;
    DMA_Init(PSOC_SPI_PORT_TX_DMA_STREAM, &DMA_InitStructure);
    // Enable the DMA transfer complete interrupt
    DMA_ITConfig(PSOC_SPI_PORT_TX_DMA_STREAM, DMA_IT_TC, ENABLE);

    // enable the interrupt in the NVIC
    NVIC_InitStructure.NVIC_IRQChannel = PSOC_SPI_PORT_DMA_TX_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = (uint8_t)(configMAX_SYSCALL_INTERRUPT_PRIORITY >> 4) + 2;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);
    // Enable dma tx request.
    SPI_I2S_DMACmd(PSOC_SPI_PORT, SPI_I2S_DMAReq_Tx, ENABLE);
}

void setupRxDma()
{
    DMA_InitTypeDef DMA_InitStructure;
    NVIC_InitTypeDef NVIC_InitStructure;

    // Set up the DMA
    DMA_DeInit(PSOC_SPI_PORT_RX_DMA_STREAM);
    /*
     * Check if the DMA Stream is disabled before enabling it.
     * Note that this step is useful when the same Stream is used multiple times:
     * enabled, then disabled then re-enabled... In this case, the DMA Stream disable
     * will be effective only at the end of the ongoing data transfer and it will
     * not be possible to re-configure it before making sure that the Enable bit
     * has been cleared by hardware. If the Stream is used only once, this step might
     * be bypassed.
     */
    while (DMA_GetCmdStatus(PSOC_SPI_PORT_RX_DMA_STREAM) != DISABLE)
        ;
    // Configure DMA controller to manage RX DMA requests
    // first make sure we are using the default values
    DMA_StructInit(&DMA_InitStructure);
    // these are the only parameters that change from the defaults
    DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t) & (PSOC_SPI_PORT->DR);
    DMA_InitStructure.DMA_Channel = PSOC_SPI_PORT_RX_DMA_CHANNEL;
    DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralToMemory;
    DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
    DMA_InitStructure.DMA_Priority = DMA_Priority_High;

