maoravni/Dev/FECDEV/FEC/Common/Libraries/BSP/psocSpiWithDma.c
    /*
     * It is not possible to call DMA_Init without values for the source
     * address and non-zero size even though a transfer is not done here.
     * These are checked only when the assert macro are active though.
     * */
    DMA_InitStructure.DMA_Memory0BaseAddr = 0;
    DMA_InitStructure.DMA_BufferSize = 1;
    DMA_Init(PSOC_SPI_PORT_RX_DMA_STREAM, &DMA_InitStructure);
    // Enable the DMA transfer complete interrupt

    DMA_ITConfig(PSOC_SPI_PORT_RX_DMA_STREAM, DMA_IT_TC, ENABLE);

    // enable the interrupt in the NVIC
    NVIC_InitStructure.NVIC_IRQChannel = PSOC_SPI_PORT_DMA_RX_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = (uint8_t)(configMAX_SYSCALL_INTERRUPT_PRIORITY >> 4) + 3;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);
}

void setupDma()
{
    // first enable the clock
    RCC_AHB1PeriphClockCmd(PSOC_SPI_PORT_DMAx_CLK, ENABLE); // start with a blank DMA configuration just to be sure

    setupTxDma();
    setupRxDma();

    // Enable dma rx +tx request.
    SPI_I2S_DMACmd(PSOC_SPI_PORT, SPI_I2S_DMAReq_Rx | SPI_I2S_DMAReq_Tx, ENABLE);
}

void PSOC_setupSpiWithDma()
{
    setupSpi();
    setupDma();

    // setup the semaphore for notification of transfer complete:
    if (psocSpiResponseCompleteSemaphore == NULL)
        vSemaphoreCreateBinary(psocSpiResponseCompleteSemaphore);
    xSemaphoreTake(psocSpiResponseCompleteSemaphore, 0);
}

void PSOC_fullDuplexTransfer(uint8_t *transmitBuffer, uint8_t length)
{
    assert(length <= M_PSOC_SPI_MAX_TRANSFER_SIZE);

    memcpy(psocSpiTransmitBuffer.buffer, transmitBuffer, length);
    psocSpiResponseBuffer.crcOk = false;
    psocSpiResponseBuffer.transferComplete = false;
    PSOC_SPI_PORT_TX_DMA_STREAM->NDTR = (uint32_t) length;
    PSOC_SPI_PORT_TX_DMA_STREAM->M0AR = (uint32_t) psocSpiTransmitBuffer.buffer;
    PSOC_SPI_PORT_RX_DMA_STREAM->NDTR = (uint32_t) length;
    PSOC_SPI_PORT_RX_DMA_STREAM->M0AR = (uint32_t) & (psocSpiResponseBuffer.buffer);
//    CS1_LOW();
    SPI_CalculateCRC(PSOC_SPI_PORT, ENABLE);
    DMA_Cmd(PSOC_SPI_PORT_RX_DMA_STREAM, DISABLE);
    DMA_Cmd(PSOC_SPI_PORT_TX_DMA_STREAM, DISABLE);
    DMA_Cmd(PSOC_SPI_PORT_RX_DMA_STREAM, ENABLE);
    DMA_Cmd(PSOC_SPI_PORT_TX_DMA_STREAM, ENABLE);
}

void PSOC_fullDuplexTransferNoCrc(uint8_t *transmitBuffer, uint8_t length)
{
    assert(length <= M_PSOC_SPI_MAX_TRANSFER_SIZE);

    memcpy(psocSpiTransmitBuffer.buffer, transmitBuffer, length);
    psocSpiResponseBuffer.crcOk = false;
    psocSpiResponseBuffer.transferComplete = false;
    PSOC_SPI_PORT_TX_DMA_STREAM->NDTR = (uint32_t) length;
    PSOC_SPI_PORT_TX_DMA_STREAM->M0AR = (uint32_t) psocSpiTransmitBuffer.buffer;
    PSOC_SPI_PORT_RX_DMA_STREAM->NDTR = (uint32_t) length;
    PSOC_SPI_PORT_RX_DMA_STREAM->M0AR = (uint32_t) & (psocSpiResponseBuffer.buffer);
//    CS1_LOW();
    SPI_CalculateCRC(PSOC_SPI_PORT, DISABLE);
    DMA_Cmd(PSOC_SPI_PORT_RX_DMA_STREAM, DISABLE);
    DMA_Cmd(PSOC_SPI_PORT_TX_DMA_STREAM, DISABLE);
    DMA_Cmd(PSOC_SPI_PORT_RX_DMA_STREAM, ENABLE);
    DMA_Cmd(PSOC_SPI_PORT_TX_DMA_STREAM, ENABLE);
}

void PSOC_sendBuffer(uint8_t *buf, uint8_t len)
{
    PSOC_SPI_PORT_TX_DMA_STREAM->NDTR = (uint32_t) len;
    PSOC_SPI_PORT_TX_DMA_STREAM->M0AR = (uint32_t) buf;
    SPI_BiDirectionalLineConfig(PSOC_SPI_PORT, SPI_Direction_Tx);
    CS1_LOW();
    DMA_Cmd(PSOC_SPI_PORT_TX_DMA_STREAM, ENABLE);
}

void PSOC_startReceive()
{
//    uint8_t buf[16];
//    memset(buf, 2, 16);
//    PSOC_SPI_PORT_RX_DMA_STREAM ->NDTR = (uint32_t) 16;
//    PSOC_SPI_PORT_RX_DMA_STREAM ->M0AR = (uint32_t) receiveBuffer;
//    PSOC_SPI_PORT_TX_DMA_STREAM ->NDTR = (uint32_t) 16;
//    PSOC_SPI_PORT_TX_DMA_STREAM ->M0AR = (uint32_t) buf;
//    DMA_Cmd(PSOC_SPI_PORT_RX_DMA_STREAM, ENABLE);
////    SPI_BiDirectionalLineConfig(PSOC_SPI_PORT, SPI_Direction_Rx);
//    DMA_Cmd(PSOC_SPI_PORT_TX_DMA_STREAM, ENABLE);
////    SPI_BiDirectionalLineConfig(PSOC_SPI_PORT, SPI_Direction_Rx);
}

#define M_CHECK_RXNE_RESET_TIMEOUT 0x1000000

// the transmit complete interrupt handler
void PSOC_SPI_PORT_DMA_TX_IRQHandler()
{
//    ITM_EVENT8(2,1);
    static int checkRxneResetCounter;
    static portBASE_TYPE xHigherPriorityTaskWoken;
//    g_txInterruptState = 0;
    // Test if DMA Stream Transfer Complete interrupt
    if (DMA_GetITStatus(PSOC_SPI_PORT_TX_DMA_STREAM, PSOC_SPI_PORT_TX_DMA_IT_TCIF))
    {
//        g_txInterruptState = 1;
        DMA_ClearITPendingBit(PSOC_SPI_PORT_TX_DMA_STREAM, PSOC_SPI_PORT_TX_DMA_IT_TCIF);
//        g_txInterruptState = 2;
        /*
         * There is an unpleasant wait until we are certain the data has been sent.
         * The need for this has been verified by oscilloscope. The shift register
         * at this point may still be clocking out data and it is not safe to
         * release the chip select line until it has finished. It only costs half
         * a microsecond so better safe than sorry. Is it...
         *
         *  a) flushed from the transmit buffer
         */
//        while (SPI_I2S_GetFlagStatus(PSOC_SPI_PORT, SPI_I2S_FLAG_TXE ) == RESET)
//            ;
//        g_txInterruptState = 3;
        /*
         * b) flushed out of the shift register
         */
//        while (SPI_I2S_GetFlagStatus(PSOC_SPI_PORT, SPI_I2S_FLAG_BSY ) == SET)
//            ;
//        g_txInterruptState = 4;
        /*
         * The DMA stream is disabled in hardware at the end of the transfer
         * Now we can deselect the display. If more than one peripheral was being run
         * on this SPI peripheral, we would have to do both/all of them, or work out
         * which one was active and deselect that one.
         */

//        checkRxneResetCounter = 0;
//        // read the last byte from the receive buffer - it's the received CRC;
//        while (checkRxneResetCounter < M_CHECK_RXNE_RESET_TIMEOUT
//                && SPI_I2S_GetFlagStatus(PSOC_SPI_PORT, SPI_I2S_FLAG_RXNE ) == RESET)
//            ++checkRxneResetCounter;
//        uint8_t tempCRC = PSOC_SPI_PORT ->DR;
//
////        psocSpiResponseBuffer.transferComplete = (checkRxneResetCounter < M_CHECK_RXNE_RESET_TIMEOUT);
//        if (checkRxneResetCounter < M_CHECK_RXNE_RESET_TIMEOUT)
//            psocSpiResponseBuffer.transferComplete = true;
//        else
//            psocSpiResponseBuffer.transferComplete = false;
//
//        if (SPI_I2S_GetFlagStatus(PSOC_SPI_PORT, SPI_FLAG_CRCERR ) == SET)
//        {
////            puts("CRC Error");
//            psocSpiResponseBuffer.crcOk = false;
//            SPI_I2S_ClearFlag(PSOC_SPI_PORT, SPI_FLAG_CRCERR );
//        }
//
//        SPI_CalculateCRC(PSOC_SPI_PORT, DISABLE);
//
//        xSemaphoreGiveFromISR(psocSpiResponseCompleteSemaphore, &xHigherPriorityTaskWoken);
//        if (xHigherPriorityTaskWoken)
//            taskYIELD();
    }
//    g_txInterruptState = 5;
//    ITM_EVENT8(2,0);
}

// the receive complete interrupt handler
void PSOC_SPI_PORT_DMA_RX_IRQHandler()
{
//    ITM_EVENT8(3,1);
    static int checkRxneResetCounter;
    static portBASE_TYPE xHigherPriorityTaskWoken;
//    g_rxInterruptState = 0;
    // Test if DMA Stream Transfer Complete interrupt
    if (DMA_GetITStatus(PSOC_SPI_PORT_RX_DMA_STREAM, PSOC_SPI_PORT_RX_DMA_IT_TCIF))
    {
//        g_rxInterruptState = 1;
        DMA_ClearITPendingBit(PSOC_SPI_PORT_RX_DMA_STREAM, PSOC_SPI_PORT_RX_DMA_IT_TCIF);
//        g_rxInterruptState = 2;
//        SPI_BiDirectionalLineConfig(PSOC_SPI_PORT, SPI_Direction_Tx);
        /*
         * There is an unpleasant wait until we are certain the data has been sent.
         * The need for this has been verified by oscilloscope. The shift register
         * at this point may still be clocking out data and it is not safe to
         * release the chip select line until it has finished. It only costs half
         * a microsecond so better safe than sorry. Is it...
         *
         *  a) flushed from the transmit buffer
         */
//        while (SPI_I2S_GetFlagStatus(PSOC_SPI_PORT, SPI_I2S_FLAG_TXE ) == RESET)
//            ;
        /*
         * b) flushed out of the shift register
         */
//        while (SPI_I2S_GetFlagStatus(PSOC_SPI_PORT, SPI_I2S_FLAG_BSY ) == SET)
//            ;
        /*
         * The DMA stream is disabled in hardware at the end of the transfer
         * Now we can deselect the display. If more than one peripheral was being run
         * on this SPI peripheral, we would have to do both/all of them, or work out
         * which one was active and deselect that one.
         */
        if (PSOC_SPI_PORT->CR1 & SPI_CR1_CRCEN)
        {
            checkRxneResetCounter = 0;
            // read the last byte from the receive buffer - it's the received CRC;
            while (checkRxneResetCounter < M_CHECK_RXNE_RESET_TIMEOUT
                    && SPI_I2S_GetFlagStatus(PSOC_SPI_PORT, SPI_I2S_FLAG_RXNE) == RESET)
                ++checkRxneResetCounter;
            uint8_t tempCRC = PSOC_SPI_PORT->DR;

//        g_rxInterruptState = 3;
//        psocSpiResponseBuffer.transferComplete = (checkRxneResetCounter < M_CHECK_RXNE_RESET_TIMEOUT);
            if (checkRxneResetCounter < M_CHECK_RXNE_RESET_TIMEOUT)
                psocSpiResponseBuffer.transferComplete = true;
            else
                psocSpiResponseBuffer.transferComplete = false;

//        g_rxInterruptState = 4;
            if (SPI_I2S_GetFlagStatus(PSOC_SPI_PORT, SPI_FLAG_CRCERR) == SET)
            {
//            puts("CRC Error");
                psocSpiResponseBuffer.crcOk = false;
                SPI_I2S_ClearFlag(PSOC_SPI_PORT, SPI_FLAG_CRCERR);
            }
            else
                psocSpiResponseBuffer.crcOk = true;
        }
        else
        {
            psocSpiResponseBuffer.transferComplete = true;
            psocSpiResponseBuffer.crcOk = true;
        }

