maoravni/Dev/FECDEV/FEC/Common/Libraries/BSP/psocSpiWithDma.c
//        g_rxInterruptState = 5;

        SPI_CalculateCRC(PSOC_SPI_PORT, DISABLE);

//        g_rxInterruptState = 6;

        // yield before giving the semaphore, in case the interrupt returned before than the
        // calling task could wait for the semaphore.
//        taskYIELD();

        xSemaphoreGiveFromISR(psocSpiResponseCompleteSemaphore, &xHigherPriorityTaskWoken);

//        g_rxInterruptState = 7;
        // FreeRTOS manual specifies that if a higher priority task is waken, the task should yield.
        // TOD: Check if the "taskYIELD" call can be removed, as the interrupt is finished here, and the
        // scheduler will probably context-switch to a higher prioriy task anyway.
        if (xHigherPriorityTaskWoken)
        {
            taskYIELD();
        }

//        g_rxInterruptState = 8;
    }
//    g_rxInterruptState = 9;
//    ITM_EVENT8(3,0);
}

/*******************************************************************************
 * Function Name: OpenConnection
 ********************************************************************************
 *
 * Summary:
 *  Initializes the communications component : In this case SPI
 *
 * Parameters:
 *  void
 *
 * Return:
 *  Returns a flag to indicate whether the operation was successful or not
 *
 *
 *******************************************************************************/
int PsocBootloader_OpenConnection(void)
{
    SPI_CalculateCRC(PSOC_SPI_PORT, DISABLE);
    //SPIM_Start();
    return (CYRET_SUCCESS);
}

/*******************************************************************************
 * Function Name: CloseConnection
 ********************************************************************************
 *
 * Summary:
 *  Clears the status and stops the communications component (SPI).
 *
 * Parameters:
 *  void
 *
 * Return:
 *  Returns a flag to indicate whether the operation was successful or not
 *
 *
 *******************************************************************************/
int PsocBootloader_CloseConnection(void)
{
    SPI_CalculateCRC(PSOC_SPI_PORT, ENABLE);
    //SPIM_Stop();
    return (CYRET_SUCCESS);
}

uint16_t Send_Receive_HalfWord(uint16_t HalfWord)
{

    /*!< Loop while DR register in not emplty */
    while (SPI_I2S_GetFlagStatus(PSOC_SPI_PORT, SPI_I2S_FLAG_TXE) == RESET)
        ;

    /*!< Send Half Word through the the SPI bus */
    SPI_I2S_SendData(PSOC_SPI_PORT, HalfWord);

    /*!< Wait to receive a Half Word */
    while (SPI_I2S_GetFlagStatus(PSOC_SPI_PORT, SPI_I2S_FLAG_RXNE) == RESET)
        ;
    while (SPI_I2S_GetFlagStatus(PSOC_SPI_PORT, SPI_I2S_FLAG_BSY) == SET)
        ;
    /*!< Return the Half Word read from the SPI bus */
    return SPI_I2S_ReceiveData(PSOC_SPI_PORT);

}

/*******************************************************************************
 * Function Name: WriteData
 ********************************************************************************
 *
 * Summary:
 *  Writes the specified number of bytes using the communications component (SPI)
 *
 * Parameters:
 *  wrData - Pointer to write data buffer
 *  byteCnt - No. of bytes to be written
 *
 * Return:
 *  Returns a flag to indicate whether the operation was successful or not
 *
 *
 *******************************************************************************/
int PsocBootloader_WriteDataNoDma(uint8_t* wrData, int byteCnt)
{
    uint8_t dummy;
    SPI_CalculateCRC(PSOC_SPI_PORT, DISABLE);

    /* Enable the SPI peripheral */
//    SPI_Cmd(PSOC_SPI_PORT, ENABLE);
    for (int i = 0; i < byteCnt; ++i)
        dummy = Send_Receive_HalfWord(wrData[i]);

//    uint8_t tempCRC = PSOC_SPI_PORT->DR;

    vTaskDelay(M_DELAY_BETWEEN_PSOC_TRANSFERS);
    /* Disable the SPI peripheral */
//    SPI_Cmd(PSOC_SPI_PORT, DISABLE);
    SPI_CalculateCRC(PSOC_SPI_PORT, DISABLE);
    return (CYRET_SUCCESS);
}

int PsocBootloader_WriteDataNonBlocking(uint8_t* wrData, int byteCnt)
{
    static int checkRxneResetCounter;
    checkRxneResetCounter = 0;

    printf("%d WriteData PSOC_fullDuplexTransferNoCrc 1\n", xTaskGetTickCount());

    PSOC_fullDuplexTransferNoCrc(wrData, byteCnt);

    printf("%d WriteData PSOC_fullDuplexTransferNoCrc 2\n", xTaskGetTickCount());

//    while (checkRxneResetCounter < M_CHECK_RXNE_RESET_TIMEOUT
//            && SPI_I2S_GetFlagStatus(PSOC_SPI_PORT, SPI_I2S_FLAG_RXNE) == RESET)
//        ++checkRxneResetCounter;
//    if (checkRxneResetCounter >= M_CHECK_RXNE_RESET_TIMEOUT)
//        return CYRET_ERR_CMD;
//    taskYIELD();
    if (xSemaphoreTake(psocSpiResponseCompleteSemaphore, 50) == pdFALSE)
    {
        return CYRET_ERR_CMD;
    }
//    taskYIELD();

    printf("%d WriteData PSOC_fullDuplexTransferNoCrc 3\n", xTaskGetTickCount());

    return CYRET_SUCCESS;
}

int PsocBootloader_WriteData(uint8_t* wrData, int byteCnt)
{
    /*
     u32 timeOut =1;

     // Clears TX and RX FIFOs and the status registers
     SPIM_ClearFIFO();

     SPIM_PutArray(wrData, byteCnt);

     // Wait till read operation is complete or timeout
     while(!(SPIM_ReadTxStatus() & SPIM_STS_SPI_DONE))
     {
     timeOut++;
     // Check for timeout and if so exit with communication error code
     if(timeOut == 0)
     {
     return(CYRET_ERR_COMM_MASK);
     }
     }
     // Give some delay before the next operation so that the slave can process the written data
     CyDelay(30);
     */
    uint8_t Dummy_rdData[M_PSOC_SPI_MAX_TRANSFER_SIZE];

    DMA_InitTypeDef DMA_InitStructure;

    /* Configure DMA Initialization Structure */
    DMA_InitStructure.DMA_BufferSize = byteCnt;
    DMA_InitStructure.DMA_FIFOMode = DMA_FIFOMode_Disable;
    DMA_InitStructure.DMA_FIFOThreshold = DMA_FIFOThreshold_1QuarterFull;
    DMA_InitStructure.DMA_MemoryBurst = DMA_MemoryBurst_Single;
    DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
    DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
    DMA_InitStructure.DMA_Mode = DMA_Mode_Normal;
    DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)(&(PSOC_SPI_PORT->DR));
    DMA_InitStructure.DMA_PeripheralBurst = DMA_PeripheralBurst_Single;
    DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
    DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
    DMA_InitStructure.DMA_Priority = DMA_Priority_High;
    /* Configure TX DMA */
    DMA_InitStructure.DMA_Channel = PSOC_SPI_PORT_TX_DMA_CHANNEL;
    DMA_InitStructure.DMA_DIR = DMA_DIR_MemoryToPeripheral;
    DMA_InitStructure.DMA_Memory0BaseAddr = (uint32_t) wrData;
    DMA_Init(PSOC_SPI_PORT_TX_DMA_STREAM, &DMA_InitStructure);
    /* Configure RX DMA */

    DMA_InitStructure.DMA_Channel = PSOC_SPI_PORT_RX_DMA_CHANNEL;
    DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralToMemory;
    DMA_InitStructure.DMA_Memory0BaseAddr = (uint32_t) Dummy_rdData;
    DMA_Init(PSOC_SPI_PORT_RX_DMA_STREAM, &DMA_InitStructure);

    SPI_CalculateCRC(PSOC_SPI_PORT, DISABLE);

    /* The Data transfer is performed in the SPI using Direct Memory Access */

