maoravni/Dev/FECDEV/FEC/Common/Libraries/BSP/psocSpiWithDma.c
    /* Enable DMA SPI TX Stream */
    DMA_Cmd(PSOC_SPI_PORT_TX_DMA_STREAM, ENABLE);

    /* Enable DMA SPI RX Stream */
    DMA_Cmd(PSOC_SPI_PORT_RX_DMA_STREAM, ENABLE);

    /* Enable SPI DMA TX Requsts */
    SPI_I2S_DMACmd(PSOC_SPI_PORT, SPI_I2S_DMAReq_Tx, ENABLE);

    /* Enable SPI DMA RX Requsts */
    SPI_I2S_DMACmd(PSOC_SPI_PORT, SPI_I2S_DMAReq_Rx, ENABLE);

    /* Enable the SPI peripheral */
//    SPI_Cmd(PSOC_SPI_PORT, ENABLE);
    /* Waiting the end of Data transfer */
    while (DMA_GetFlagStatus(PSOC_SPI_PORT_TX_DMA_STREAM, PSOC_SPI_PORT_TX_DMA_FLAG_TCIF) == RESET)
        ;
    while (DMA_GetFlagStatus(PSOC_SPI_PORT_RX_DMA_STREAM, PSOC_SPI_PORT_RX_DMA_FLAG_TCIF) == RESET)
        ;

    /* Clear DMA Transfer Complete Flags */
    DMA_ClearFlag(PSOC_SPI_PORT_TX_DMA_STREAM, PSOC_SPI_PORT_TX_DMA_FLAG_TCIF);
    DMA_ClearFlag(PSOC_SPI_PORT_RX_DMA_STREAM, PSOC_SPI_PORT_RX_DMA_FLAG_TCIF);

    /* Disable DMA SPI TX Stream */
    DMA_Cmd(PSOC_SPI_PORT_TX_DMA_STREAM, DISABLE);

    /* Disable DMA SPI RX Stream */
    DMA_Cmd(PSOC_SPI_PORT_RX_DMA_STREAM, DISABLE);

    /* Disable SPI DMA TX Requsts */
    SPI_I2S_DMACmd(PSOC_SPI_PORT, SPI_I2S_DMAReq_Tx, DISABLE);

    /* Disable SPI DMA RX Requsts */
    SPI_I2S_DMACmd(PSOC_SPI_PORT, SPI_I2S_DMAReq_Rx, DISABLE);

    while (SPI_I2S_GetFlagStatus(PSOC_SPI_PORT, SPI_I2S_FLAG_RXNE) == RESET)
        ;
    //tempCRC = PSOC_SPI_PORT->DR;//dummi read

    /* Disable the SPI peripheral */
//    SPI_Cmd(PSOC_SPI_PORT, DISABLE);
    SPI_CalculateCRC(PSOC_SPI_PORT, DISABLE);
    return (CYRET_SUCCESS);
}

/*******************************************************************************
 * Function Name: ReadData
 ********************************************************************************
 *
 * Summary:
 *  Reads the specified number of bytes usign the communications component (SPI)
 *
 * Parameters:
 *  rdData - Pointer to read data buffer
 *  byteCnt - No. of bytes to be read
 *
 * Return:
 *  Returns a flag to indicate whether the operation was successful or not
 *
 *
 *******************************************************************************/
int PsocBootloader_ReadDataNoDma(uint8_t* rdData, int byteCnt)
{
    uint8_t dummy;

    SPI_CalculateCRC(PSOC_SPI_PORT, DISABLE);

    /* Enable the SPI peripheral */
    //SPI_Cmd(PSOC_SPI_PORT, ENABLE);
    for (int i = 0; i < byteCnt; ++i)
        rdData[i] = Send_Receive_HalfWord(dummy);

//    uint8_t tempCRC = PSOC_SPI_PORT->DR;
    /* Disable the SPI peripheral */
    //SPI_Cmd(PSOC_SPI_PORT, DISABLE);
    SPI_CalculateCRC(PSOC_SPI_PORT, DISABLE);

    vTaskDelay(M_DELAY_BETWEEN_PSOC_TRANSFERS);
    return (CYRET_SUCCESS);
}

int PsocBootloader_ReadDataNonBlocking(uint8_t* rdData, int byteCnt)
{
    static int checkRxneResetCounter;
    checkRxneResetCounter = 0;
    uint8_t dummyBuffer[M_PSOC_SPI_MAX_TRANSFER_SIZE];

    PSOC_fullDuplexTransferNoCrc(dummyBuffer, byteCnt);

//    while (checkRxneResetCounter < M_CHECK_RXNE_RESET_TIMEOUT
//            && SPI_I2S_GetFlagStatus(PSOC_SPI_PORT, SPI_I2S_FLAG_RXNE) == RESET)
//        ++checkRxneResetCounter;
//    if (checkRxneResetCounter >= M_CHECK_RXNE_RESET_TIMEOUT)
//        return CYRET_ERR_CMD;
//    taskYIELD();
    if (xSemaphoreTake(psocSpiResponseCompleteSemaphore, 50) == pdFALSE)
    {
        return CYRET_ERR_CMD;
    }
//    taskYIELD();

    memcpy(rdData, psocSpiResponseBuffer.buffer, byteCnt);
    return CYRET_SUCCESS;
}

int PsocBootloader_ReadData(uint8_t* rdData, int byteCnt)
{
    uint8_t Dummy_wrData[M_PSOC_SPI_MAX_TRANSFER_SIZE];

    DMA_InitTypeDef DMA_InitStructure;

    /* Configure DMA Initialization Structure */
    DMA_InitStructure.DMA_BufferSize = byteCnt;
    DMA_InitStructure.DMA_FIFOMode = DMA_FIFOMode_Disable;
    DMA_InitStructure.DMA_FIFOThreshold = DMA_FIFOThreshold_1QuarterFull;
    DMA_InitStructure.DMA_MemoryBurst = DMA_MemoryBurst_Single;
    DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
    DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
    DMA_InitStructure.DMA_Mode = DMA_Mode_Normal;
    DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)(&(PSOC_SPI_PORT->DR));
    DMA_InitStructure.DMA_PeripheralBurst = DMA_PeripheralBurst_Single;
    DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
    DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
    DMA_InitStructure.DMA_Priority = DMA_Priority_High;
    /* Configure TX DMA */
    DMA_InitStructure.DMA_Channel = PSOC_SPI_PORT_TX_DMA_CHANNEL;
    DMA_InitStructure.DMA_DIR = DMA_DIR_MemoryToPeripheral;
    DMA_InitStructure.DMA_Memory0BaseAddr = (uint32_t) Dummy_wrData;
    DMA_Init(PSOC_SPI_PORT_TX_DMA_STREAM, &DMA_InitStructure);
    /* Configure RX DMA */

    DMA_InitStructure.DMA_Channel = PSOC_SPI_PORT_RX_DMA_CHANNEL;
    DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralToMemory;
    DMA_InitStructure.DMA_Memory0BaseAddr = (uint32_t) rdData;
    DMA_Init(PSOC_SPI_PORT_RX_DMA_STREAM, &DMA_InitStructure);

    SPI_CalculateCRC(PSOC_SPI_PORT, DISABLE);

    /* The Data transfer is performed in the SPI using Direct Memory Access */

    /* Enable DMA SPI TX Stream */
    DMA_Cmd(PSOC_SPI_PORT_TX_DMA_STREAM, ENABLE);

    /* Enable DMA SPI RX Stream */
    DMA_Cmd(PSOC_SPI_PORT_RX_DMA_STREAM, ENABLE);

    /* Enable SPI DMA TX Requsts */
    SPI_I2S_DMACmd(PSOC_SPI_PORT, SPI_I2S_DMAReq_Tx, ENABLE);

    /* Enable SPI DMA RX Requsts */
    SPI_I2S_DMACmd(PSOC_SPI_PORT, SPI_I2S_DMAReq_Rx, ENABLE);

    /* Enable the SPI peripheral */
//    SPI_Cmd(PSOC_SPI_PORT, ENABLE);
    /* Waiting the end of Data transfer */
    while (DMA_GetFlagStatus(PSOC_SPI_PORT_TX_DMA_STREAM, PSOC_SPI_PORT_TX_DMA_FLAG_TCIF) == RESET)
        ;
    while (DMA_GetFlagStatus(PSOC_SPI_PORT_RX_DMA_STREAM, PSOC_SPI_PORT_RX_DMA_FLAG_TCIF) == RESET)
        ;

    /* Clear DMA Transfer Complete Flags */
    DMA_ClearFlag(PSOC_SPI_PORT_TX_DMA_STREAM, PSOC_SPI_PORT_TX_DMA_FLAG_TCIF);
    DMA_ClearFlag(PSOC_SPI_PORT_RX_DMA_STREAM, PSOC_SPI_PORT_RX_DMA_FLAG_TCIF);

    /* Disable DMA SPI TX Stream */
    DMA_Cmd(PSOC_SPI_PORT_TX_DMA_STREAM, DISABLE);

    /* Disable DMA SPI RX Stream */
    DMA_Cmd(PSOC_SPI_PORT_RX_DMA_STREAM, DISABLE);

