maoravni/Dev/FECDEV/FEC/Common/Libraries/BSP/psocSpiWithDma.c
    /* Disable SPI DMA TX Requsts */
    SPI_I2S_DMACmd(PSOC_SPI_PORT, SPI_I2S_DMAReq_Tx, DISABLE);

    /* Disable SPI DMA RX Requsts */
    SPI_I2S_DMACmd(PSOC_SPI_PORT, SPI_I2S_DMAReq_Rx, DISABLE);

    while (SPI_I2S_GetFlagStatus(PSOC_SPI_PORT, SPI_I2S_FLAG_RXNE) == RESET)
        ;
    //tempCRC = PSOC_SPI_PORT->DR;//dummi read

    /* Disable the SPI peripheral */
//    SPI_Cmd(PSOC_SPI_PORT, DISABLE);
    SPI_CalculateCRC(PSOC_SPI_PORT, DISABLE);
    return (CYRET_SUCCESS);
}

CyBtldr_CommunicationsData* PsocBootloader_Setup()
{
//    // Set up the DMA
//    DMA_DeInit(PSOC_SPI_PORT_TX_DMA_STREAM);
//    // Set up the DMA
//    DMA_DeInit(PSOC_SPI_PORT_RX_DMA_STREAM);
//
//    NVIC_InitTypeDef NVIC_InitStructure;
//    // enable the interrupt in the NVIC
//    NVIC_InitStructure.NVIC_IRQChannel = PSOC_SPI_PORT_DMA_TX_IRQn;
//    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = (uint8_t)(configMAX_SYSCALL_INTERRUPT_PRIORITY >> 4) + 2;
//    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
//    NVIC_InitStructure.NVIC_IRQChannelCmd = DISABLE;
//    NVIC_Init(&NVIC_InitStructure);
//    // enable the interrupt in the NVIC
//    NVIC_InitStructure.NVIC_IRQChannel = PSOC_SPI_PORT_DMA_RX_IRQn;
//    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = (uint8_t)(configMAX_SYSCALL_INTERRUPT_PRIORITY >> 4) + 3;
//    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
//    NVIC_InitStructure.NVIC_IRQChannelCmd = DISABLE;
//    NVIC_Init(&NVIC_InitStructure);
//    DMA_ITConfig(PSOC_SPI_PORT_TX_DMA_STREAM, DMA_IT_TC, DISABLE);
//    DMA_ITConfig(PSOC_SPI_PORT_RX_DMA_STREAM, DMA_IT_TC, DISABLE);

    CyBtldr_Callbacks.OpenConnection = &PsocBootloader_OpenConnection;
    CyBtldr_Callbacks.CloseConnection = &PsocBootloader_CloseConnection;
//    CyBtldr_Callbacks.ReadData = &PsocBootloader_ReadData;
//    CyBtldr_Callbacks.WriteData = &PsocBootloader_WriteData;
    CyBtldr_Callbacks.ReadData = &PsocBootloader_ReadDataNoDma;
    CyBtldr_Callbacks.WriteData = &PsocBootloader_WriteDataNoDma;
//    CyBtldr_Callbacks.ReadData = &PsocBootloader_ReadDataNonBlocking;
//    CyBtldr_Callbacks.WriteData = &PsocBootloader_WriteDataNonBlocking;
    CyBtldr_Callbacks.MaxTransferSize = M_PSOC_SPI_MAX_TRANSFER_SIZE;
    return &CyBtldr_Callbacks;
}

/* [] END OF FILE */

